<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,640,640"/>
			<rt_info>
				<attribute name="fused_names" value="images" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="images" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="model.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="16, 3, 6, 6" size="6912"/>
			<rt_info>
				<attribute name="fused_names" value="model.0.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.0.conv.weight" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Convolution_129" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_129" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Reshape_149" type="Const" version="opset1">
			<data element_type="f32" offset="6912" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_148, Reshape_149, input" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="onnx::Conv_124" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_124, onnx::Mul_123" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_124" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model.1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="6976" shape="32, 16, 3, 3" size="18432"/>
			<rt_info>
				<attribute name="fused_names" value="model.1.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.1.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Convolution_179" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_179" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_199" type="Const" version="opset1">
			<data element_type="f32" offset="25408" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="input.4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_198, Reshape_199, input.4" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.4" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="onnx::Conv_127" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_127, onnx::Mul_126" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_127" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model.2.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="25536" shape="16, 32, 1, 1" size="2048"/>
			<rt_info>
				<attribute name="fused_names" value="model.2.cv1.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.2.cv1.conv.weight" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Convolution_229" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_229" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape_249" type="Const" version="opset1">
			<data element_type="f32" offset="27584" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="input.8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_248, Reshape_249, input.8" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.8" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="onnx::Conv_130" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_130, onnx::Mul_129" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_130" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model.2.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="27648" shape="16, 16, 1, 1" size="1024"/>
			<rt_info>
				<attribute name="fused_names" value="model.2.m.0.cv1.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.2.m.0.cv1.conv.weight" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Convolution_279" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_279" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_299" type="Const" version="opset1">
			<data element_type="f32" offset="28672" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="input.12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_298, Reshape_299, input.12" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.12" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="onnx::Conv_133" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_133, onnx::Mul_132" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_133" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model.2.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="28736" shape="16, 16, 3, 3" size="9216"/>
			<rt_info>
				<attribute name="fused_names" value="model.2.m.0.cv2.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.2.m.0.cv2.conv.weight" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Convolution_329" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_329" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_349" type="Const" version="opset1">
			<data element_type="f32" offset="37952" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="input.16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_348, Reshape_349, input.16" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.16" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="onnx::Add_136" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_136, onnx::Mul_135" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Add_136" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="onnx::Concat_137" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Concat_137" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Concat_137" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model.2.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="38016" shape="16, 32, 1, 1" size="2048"/>
			<rt_info>
				<attribute name="fused_names" value="model.2.cv2.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.2.cv2.conv.weight" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Convolution_380" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_380" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_400" type="Const" version="opset1">
			<data element_type="f32" offset="40064" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="input.20" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_399, Reshape_400, input.20" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.20" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="onnx::Concat_140" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Concat_140, onnx::Mul_139" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Concat_140" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="input.24" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" value="input.24" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.24" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model.2.cv3.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="40128" shape="32, 32, 1, 1" size="4096"/>
			<rt_info>
				<attribute name="fused_names" value="model.2.cv3.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.2.cv3.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Convolution_431" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_431" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_451" type="Const" version="opset1">
			<data element_type="f32" offset="44224" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="input.28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_450, Reshape_451, input.28" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.28" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="onnx::Conv_144" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_144, onnx::Mul_143" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_144" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model.3.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="44352" shape="64, 32, 3, 3" size="73728"/>
			<rt_info>
				<attribute name="fused_names" value="model.3.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.3.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Convolution_481" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_481" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_501" type="Const" version="opset1">
			<data element_type="f32" offset="118080" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="input.32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_500, Reshape_501, input.32" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.32" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="onnx::Conv_147" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_147, onnx::Mul_146" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_147" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model.4.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="118336" shape="32, 64, 1, 1" size="8192"/>
			<rt_info>
				<attribute name="fused_names" value="model.4.cv1.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.4.cv1.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Convolution_531" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_531" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_551" type="Const" version="opset1">
			<data element_type="f32" offset="126528" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="input.36" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_550, Reshape_551, input.36" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.36" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="onnx::Conv_150" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_150, onnx::Mul_149" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_150" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model.4.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="126656" shape="32, 32, 1, 1" size="4096"/>
			<rt_info>
				<attribute name="fused_names" value="model.4.m.0.cv1.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.4.m.0.cv1.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Convolution_581" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_581" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Reshape_601" type="Const" version="opset1">
			<data element_type="f32" offset="130752" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="input.40" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_600, Reshape_601, input.40" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.40" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="onnx::Conv_153" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_153, onnx::Mul_152" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_153" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model.4.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="130880" shape="32, 32, 3, 3" size="36864"/>
			<rt_info>
				<attribute name="fused_names" value="model.4.m.0.cv2.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.4.m.0.cv2.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Convolution_631" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_631" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_651" type="Const" version="opset1">
			<data element_type="f32" offset="167744" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="input.44" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_650, Reshape_651, input.44" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.44" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="onnx::Add_156" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_156, onnx::Mul_155" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Add_156" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="input.48" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="input.48" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.48" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model.4.m.1.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="167872" shape="32, 32, 1, 1" size="4096"/>
			<rt_info>
				<attribute name="fused_names" value="model.4.m.1.cv1.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.4.m.1.cv1.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Convolution_682" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_682" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Reshape_702" type="Const" version="opset1">
			<data element_type="f32" offset="171968" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="input.52" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_701, Reshape_702, input.52" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.52" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="onnx::Conv_160" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_160, onnx::Mul_159" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_160" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model.4.m.1.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="172096" shape="32, 32, 3, 3" size="36864"/>
			<rt_info>
				<attribute name="fused_names" value="model.4.m.1.cv2.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.4.m.1.cv2.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Convolution_732" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_732" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_752" type="Const" version="opset1">
			<data element_type="f32" offset="208960" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="input.56" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_751, Reshape_752, input.56" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.56" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="onnx::Add_163" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Add_163, onnx::Mul_162" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Add_163" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="onnx::Concat_164" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="onnx::Concat_164" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Concat_164" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model.4.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="209088" shape="32, 64, 1, 1" size="8192"/>
			<rt_info>
				<attribute name="fused_names" value="model.4.cv2.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.4.cv2.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Convolution_783" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_783" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_803" type="Const" version="opset1">
			<data element_type="f32" offset="217280" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="input.60" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_802, Reshape_803, input.60" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.60" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="onnx::Concat_167" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Concat_167, onnx::Mul_166" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Concat_167" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="input.64" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" value="input.64" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.64" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="model.4.cv3.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="217408" shape="64, 64, 1, 1" size="16384"/>
			<rt_info>
				<attribute name="fused_names" value="model.4.cv3.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.4.cv3.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Convolution_834" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_834" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Reshape_854" type="Const" version="opset1">
			<data element_type="f32" offset="233792" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="input.68" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_853, Reshape_854, input.68" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.68" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="onnx::Conv_171" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_171, onnx::Mul_170" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_171" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="model.5.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="234048" shape="128, 64, 3, 3" size="294912"/>
			<rt_info>
				<attribute name="fused_names" value="model.5.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.5.conv.weight" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Convolution_884" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_884" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Reshape_904" type="Const" version="opset1">
			<data element_type="f32" offset="528960" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="input.72" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_903, Reshape_904, input.72" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.72" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="onnx::Conv_174" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_174, onnx::Mul_173" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_174" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="model.6.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="529472" shape="64, 128, 1, 1" size="32768"/>
			<rt_info>
				<attribute name="fused_names" value="model.6.cv1.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.6.cv1.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Convolution_934" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_934" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_954" type="Const" version="opset1">
			<data element_type="f32" offset="562240" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="input.76" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_953, Reshape_954, input.76" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.76" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="onnx::Conv_177" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="onnx::Conv_177, onnx::Mul_176" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_177" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model.6.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="562496" shape="64, 64, 1, 1" size="16384"/>
			<rt_info>
				<attribute name="fused_names" value="model.6.m.0.cv1.conv.weight" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="model.6.m.0.cv1.conv.weight" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Convolution_984" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="Convolution_984" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Reshape_1004" type="Const" version="opset1">
			<data element_type="f32" offset="578880" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="input.80" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Concat_1003, Reshape_1004, input.80" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
